### DAY 1
### Basics of Python

Basic Data Structures:

In [2]:
#Creating Variables
n = 5
print(n)

5

In [4]:
#checking variable type
type(n)

int

In [5]:
y = "yellow"
print(y)

yellow

In [6]:
type(y)

str

In [7]:
#Using the variables created
#Add 3 to n
n+3

8

In [8]:
#Make y upper case
y.upper()

'YELLOW'

In [9]:
#Concatenate y with black
y+ 'black'

'yellowblack'

In [10]:
#Overwrite the value of n and print it
n = 15
print(n)

15

In [11]:
#Print out information in a user-friendly form (e.g. by combining strings and the values of variables).
print("The value of n is", n)

The value of n is 15

In [12]:
#\n signifies a new line
print("Wait! What did you say the value of n was? \nIt is", n,"I said!")

Wait! What did you say the value of n was?
It is 15 I said!

#### Python Data Structures
#### Tuples

In [13]:
#Create a new tuple called my_tuple
my_tuple = (10, 20, 30, 40, 50)
my_tuple

(10, 20, 30, 40, 50)

In [14]:
#Access the second element of my_tuple
my_tuple[1] #since in python the array is zero indexed

20

In [15]:
#Assign a different value to that element, it would fail because a tuple is always constant amd doesn't changes
my_tuple[1] = 21

TypeError: 'tuple' object does not support item assignment

#### Lists

In [16]:
#Lists are variable and can be changed
#Create a list of elements in string
animal_list = ['cat', 'dog', 'lion', 'spider', 'eagle']

In [17]:
#Access the element with index 2
animal_list[2]

'lion'

In [18]:
#Add a new element to the list and return it
animal_list.append('mouse')
animal_list

['cat', 'dog', 'lion', 'spider', 'eagle', 'mouse']

In [19]:
#Remove an element from the list
animal_list.remove('cat')
animal_list

['dog', 'lion', 'spider', 'eagle', 'mouse']

#### Dictionaries
Dictionaries are used to store data values in key:value pairs.
A dictionary is a collection which is ordered*, changeable and does not allow duplicates.

In [20]:
#Create a new dictionary called 'ages' and return it.
ages = {"Sam": 40, "Nate": 35, "Blair": 30}
ages

{'Sam': 40, 'Nate': 35, 'Blair': 30}

In [21]:
#get Blair's age
ages["Blair"]

30

In [22]:
#Modify Sam's age
ages["Sam"] = 32
ages

{'Sam': 32, 'Nate': 35, 'Blair': 30}

#### Data Structures in the Pandas Library

In [23]:
import pandas as pd

#### Series

In [25]:
#Create series called my_grades and return it
my_grades = pd.Series([80, 85, 86, 90], index = ["Maths", "Physics", "Chemistry", "English"])
my_grades

Maths        80
Physics      85
Chemistry    86
English      90
dtype: int64

In [26]:
#Print the index of 'my_grades' and then print the values of 'my_grades'.
print(my_grades.index)
print(my_grades.values)

Index(['Maths', 'Physics', 'Chemistry', 'English'], dtype='object')
[80 85 86 90]

In [27]:
my_grades["Maths"]

80

#### Dataframe

In [30]:
data = {'StudentID': ["s01", "s02", "s03", "s04"],
       'name': ['Sam', 'Denis', 'Baz', 'Maisel'],
       'age': [20, 21, 22, 23],
       'grade': [56, 65, 46, 85]}
data

{'StudentID': ['s01', 's02', 's03', 's04'],
 'name': ['Sam', 'Denis', 'Baz', 'Maisel'],
 'age': [20, 21, 22, 23],
 'grade': [56, 65, 46, 85]}

In [32]:
#specify a name
maths_class = pd.DataFrame(data)
maths_class

  StudentID    name  age  grade
0       s01     Sam   20     56
1       s02   Denis   21     65
2       s03     Baz   22     46
3       s04  Maisel   23     85

In [33]:
#specify the sequence of columns
maths_class = pd.DataFrame(data, columns=['StudentID', 'name', 'age', 'grade'])
maths_class

  StudentID    name  age  grade
0       s01     Sam   20     56
1       s02   Denis   21     65
2       s03     Baz   22     46
3       s04  Maisel   23     85

In [34]:
#Get the name column
maths_class['name']

0       Sam
1     Denis
2       Baz
3    Maisel
Name: name, dtype: object

In [35]:
maths_class.name

0       Sam
1     Denis
2       Baz
3    Maisel
Name: name, dtype: object

In [36]:
#Now let's add a column called 'degree' and return the 'physics_class' DataFrame.
maths_class['degree'] = ['maths', 'science', 'literature', 'arts']
maths_class

  StudentID    name  age  grade      degree
0       s01     Sam   20     56       maths
1       s02   Denis   21     65     science
2       s03     Baz   22     46  literature
3       s04  Maisel   23     85        arts